using System.Runtime.InteropServices;

namespace ActBuilder
{
    /// <summary>
    ///  Имеет метод мейн, через который осуществляется отладка написанных функций.
    /// </summary>
    class Program
    {
        static void Main()
        {
                string json = @"{
      ""id"" : 1,
      ""name"": ""qwerty"",
      ""path"": ""C:\\Users\\danek\\Desktop"",
      ""commonInfo"": {
            ""id"" : 0,
            ""name"" : ""Общая информация"",
            ""type"" : ""commonInfo"",
            ""fields"" : [
                {
                    ""text"" : ""хаха"",
                    ""hasSpace"" : true,
                    ""subText"" : ""кек""
                },
                {
                    ""text"" : ""lolkek"",
                    ""hasSpace"" : false
                } 
            ]
    
      },
      ""acts"": [
        {
            ""id"" : 1,
            ""name"" : ""first"",
            ""type"" : ""actOSR"",
            ""fields"" : [
                {
                    ""text"" : ""haррррррррррррррррррр ррррррр ррррррррр рррр рррррррр ррррр рррррр рррррр ррррррррррррррр рррр ррррррр рррр рррррр ррррррррррh"",
                    ""hasSpace"" : true,
                    ""subText"" : ""heh""
                },
                {
                    ""text"" : ""hhhhhhh hhhhhhhhhhhhhh hhhhhhhhhhhhhhhhhhhhhhhh hhhhhhhhhhhhhhhhhhhhh hhhhhhhhhhhhh hh h hhhhhhhhhhh hhhhhhhh hhhhhhhh hhhhhhh hhhh h hh h hhhhhhhhhhh hhhhhhhh hhhhhhhh hhhhhhh hhhh h hh h hhhhhhhhhhh hhhhhhhh hhhhhhhh hhhhhhh hhhh h hh h hhhhhhhhhhh hhhhhhhh hhhhhhhh hhhhhhh hhhh h hh h hhhhhhhhhhh hhhhhhhh hhhhhhhh hhhhhhh hhhh h hh h hhhhhhhhhhh hhhhhhhh hhhhhhhh hhhhhhh hhhh h"",
                    ""hasSpace"" : false
                }
            ]
        },
        {
            ""id"" : 2,
            ""name"" : ""second"",
            ""type"" : ""actOSR"",
            ""fields"" : [
                {
                    ""text"" : ""мда уж"",
                    ""hasSpace"" : false
                },
                {
                    ""text"" : ""hoh1"",
                    ""hasSpace"" : true,
                    ""subText"" : ""heh2""
                }
            ]
        }
      ]
    }
    "
            ;
            string jsonFromApp = @"
{""id"":3,""name"":""ВК 1 эт. 10. к5"",""path"":""C:\\Users\\danek\\Downloads"",""acts"":[{""id"":1,""name"":""lol"",""type"":""actOSR"",""fields"":[{""text"":""ВК-В1,Т3-К10-12"",""hasSpace"":false,""subText"":null},{""text"":"""",""hasSpace"":false,""subText"":""26 мая 2023 г.""},{""text"":""Монтаж раскатки трубопроводов систем холодного и горячего водоснабжения "",""hasSpace"":false,""subText"":""аввв""},{""text"":""Шифр проекта 13/07-20-Р-ВК-К-10 лист 5,25 ГИП Яресько Е.А. \nЛол ю даед"",""hasSpace"":false,""subText"":null},{""text"":""Труба из сшитого полиэтилена PE-Xa ф20х2,0  ( Сертификат соответствия №РОСС RU.НВ63.Н00625/22, срок действия с 17.03.2022 по 16.03.2025г.); Трубы защитные гофрированные под трубу ф20 (25/21) ( Сертификат соответствия №РОСС RU.04РИД0.ОСП04.С00630, срок действия с 26.01.2022г. по 25.01.2025г.)"",""hasSpace"":false,""subText"":null},{""text"":""Исполнительная схема  №ВК-В1,Т3-К10. Лист 1,2."",""hasSpace"":false,""subText"":null},{""text"":""24 мая 2023 г."",""hasSpace"":false,""subText"":null},{""text"":""26 мая 2023 г."",""hasSpace"":false,""subText"":null},{""text"":""Шифр проекта 13/07-20-Р-ВК-К-10 лист 5,25 ГИП Яресько Е.А. "",""hasSpace"":false,""subText"":""СП 73.13330.2016 \""Внутренние санитарно-технические системы зданий\"";СП 40-102-2000 \""Проектирование и монтаж трубопроводов систем водоснабжения и канализации из полимерных материалов\"";СП 30.133330.2016 \""Внутренний водопровод и канализация зданий\"";СП 118.13330.2012 \""Общественные здания и сооружения\""""},{""text"":"""",""hasSpace"":false,""subText"":null},{""text"":"""",""hasSpace"":false,""subText"":null},{""text"":"" Исполнительная схема  №ВК-В1,Т3-К10. Лист 1,2; Сертификат соответствия №РОСС RU.НВ63.Н00625/22, срок действия с 17.03.2022 по 16.03.2025г.; Сертификат соответствия №РОСС RU.04РИД0.ОСП04.С00630, срок действия с 26.01.2022г. по 25.01.2025г."",""hasSpace"":false,""subText"":null}]}],""commonInfo"":{""id"":-1,""name"":""Общая информация"",""type"":""commonInfo"",""fields"":[{""text"":""«Многоквартирный жилой комплекс на земельном, участке с кадастровым номером 23:49:0000000:8647, Краснодарский край, г. Сочи, Хостинский район». Четвертый этап строительства. Корпус 10."",""hasSpace"":false,""subText"":null},{""text"":""ООО «УК 214 СОЧИ» ОГРН 1212300036410, ИНН 2366028749; 354055, Россия, Краснодарский край, г. Сочи, ул. Краснодонская, д. 77, пом.12; Выписка из реестра членов СРО № 556 от 27.08.2021 г., Саморегулируемая организация Ассоциация строителей \""Профессиональное сообщество строителей\"" (СРО АС \""ПСС'J, рег. номер в государственном реестре саморегулируемых организаций СРО № СРО-С-098-04122009"",""hasSpace"":false,""subText"":null},{""text"":"" ООО «Грант Строй Сочи» ОГРН 1212300051985; ИНН 2366030963; 354055, Краснодарский край, г. Сочи, ул. Краснодонская, дом 77, помещение 4, тел.: +7 (938) 526-40-80; Выписка из реестра членов СРО № 1326 от 24.09.2021 г., Союз «Саморегулируемая организация «Межрегиональный альянс строителей» (Союз «СРО «МАС»), рег. номер в государственном реестре саморегулируемых организаций СРО-С-170-13012010, ИНН 2366030963, ОГРН 1212300051985"",""hasSpace"":false,""subText"":null},{""text"":""ООО «МОС Проект» ОГРН 1152310006364, ИНН 2310187521; 350033, РФ, Краснодарский край, г.Краснодар, ул. Базовская дамба, д. 4, литер А, тел. (918) 165-15-18, выписка из реестра №1211 от 26.10.2020 г., выдана Союзом \""СРО Краснодарские проектировщики\"" ОГРН 1102300002397, ИНН 2308165834"",""hasSpace"":false,""subText"":null},{""text"":""Заместитель руководителя отдела строительного контроля ООО «УК 214 СОЧИ»  Кондратенко В.Ю., идентификационный номер С-23-200260 от 03.09.2020 г., в Национальном реестре специалистов в области строительства, приказ № 2 от 28.02.2022 г. ОГРН 1212300036410, ИНН 2366028749; 354055, Россия, Краснодарский край, г. Сочи, ул. Краснодонская, д. 77, пом.12"",""hasSpace"":false,""subText"":null},{""text"":""Производитель работ ООО \""Грант Строй Сочи\""  Салгин Д.А., приказ № 26/КИС от 27.10.2022 г."",""hasSpace"":false,""subText"":null},{""text"":""Руководитель отдела строительного контроля  ООО \""Грант Строй Сочи\""  Науменко А.А., приказ № 38/КИС от 01.12.2022г., идентификационный номер в реестре специалистов № С-23-189545 с 29.04.2022 г. "",""hasSpace"":false,""subText"":null},{""text"":""  Главный инженер проекта  ООО «МОС Проект»  Овсянников О.В. , приказ №7 от 17.08.2020 г.; ООО «МОС Проект», ОГРН 1152310006364, ИНН 2310187521; 350033, РФ, Краснодарский край, г.Краснодар, ул. Базовская дамба, д. 4, литер А, тел. (918) -165-15-18, выписка из реестра №1211 от 26.10.2020 г., выдана Союзом «СРО «Краснодарские проектировщики», ОГРН 1102300002397, ИНН2308165834"",""hasSpace"":false,""subText"":null},{""text"":"" Мастер участка ООО \""ТЕПЛОСТРОЙСЕТЬ\"" Хоружев С.Е. приказ №6-П от 12.09.2022г.,  ООО \""ТЕПЛОСТРОЙСЕТЬ\"" ИНН 2312307697/231201001, ОГРН 1222300004970, Краснодарский край, г. Краснодар, ул. Трамвайная, 13/1, офис 1."",""hasSpace"":false,""subText"":null},{""text"":"""",""hasSpace"":false,""subText"":null},{""text"":"" ООО \""ТЕПЛОСТРОЙСЕТЬ\"""",""hasSpace"":false,""subText"":null},{""text"":""4"",""hasSpace"":false,""subText"":""-х экземплярах""},{""text"":"""",""hasSpace"":true,""subText"":"" Кондратенко В.Ю.""},{""text"":"""",""hasSpace"":true,""subText"":"" Салгин Д.А.""},{""text"":"""",""hasSpace"":true,""subText"":"" Науменко А.А.""},{""text"":"""",""hasSpace"":true,""subText"":"" Овсянников О.В. ""},{""text"":"""",""hasSpace"":true,""subText"":"" Хоружев С.Е.""},{""text"":"""",""hasSpace"":false,""subText"":null}]}}
";
            var a = Marshal.StringToHGlobalAnsi(jsonFromApp);
            //Console.WriteLine(FlutterAdapter.MakeFile(a));

            //Console.WriteLine(FlutterAdapter.OpenFile(Marshal.StringToHGlobalUni(@"C:\Users\danek\Desktop\qwerty.xlsx")));
        }
    }
}
